package tests.ui;

public class PodpiskaTests {
    /*
    step зайти на главную страницу
    step перейти на страницу подписки https://podpiska.pochta.ru/
    step в поле поиска ввести полное наименование журнала и нажать Enter
    step выбрать купить себе
    step выьрать на Адрес
    step ввести ФИО и адресные данные
    step выбор месяцев подписки
    step проверить стоимость
    step положить товар в корзину
    step перейти в корзину
    step проверить параметры выбора и сумму
    step отредактировать парметры
    step проверить параметры выбора и сумму
    step удалить товар из коризну и проверить. что она пустая

    * */
}
